posts/2019-06-10-what-we-need.org
#+title: What We Need
#+date: <2019-06-10>
#+filetags:  quotes
#+setupfile: ../org-templates/post.org

#+ATTR_HTML: :class bigquote
#+begin_quote
People can be entertained on devices 24 hours a day; they do not need a church for that. They need a church for silence, reverence, community, ancient wisdom, the opportunity to be of service, the real presence of God.
#+end_quote

#+ATTR_HTML: :class bigquote
Anna Keating[fn:1]

#+begin_tagline
Tagged:  [[file:../tags/quotes.org][Quotes]]
#+end_tagline

* Footnotes

[fn:1] ”[[https://www.americamagazine.org/faith/2019/05/02/why-evangelical-megachurches-are-embracing-some-catholic-traditions][Why Evangelical Megachurches Are Embracing (Some) Catholic Traditions]]” 
